z = str(input("Пытаетесь ли вы занять лидерскую позицию в коллективе?"))
if z == "всегда, я же альфа":
    x = str(input("Считаете ли вы, что каждый человек должен оставить после себя потомство?"))
    if x =="конечно!":
        c = str(input("Едите ли вы на ночь?"))
        if c =="еще как":
            v = str(input("Какое человеческое качество вам кажется наиболее мерзким?"))
            if v =="тупость":
                b = str(input("Какое качество вы считаете наиболее переоцененным?"))
                if b =="оригинальность":
                    n = str(input("Какая мысль пугает вас более всего?"))
                    if n =="я умру":
                        print("вы какойто хлеб")
if z =="да я лучше сгорю":
    x = str(input("Считаете ли вы, что каждый человек должен оставить после себя потомство?"))
    if x =="только и делаю, что оставляю":
        c = str(input("Едите ли вы на ночь?"))
        if c =="надо же хоть что-то делать":
            v = str(input("Какое человеческое качество вам кажется наиболее мерзким?"))
            if v =="жадность":
                b = str(input("Какое качество вы считаете наиболее переоцененным?"))
                if b =="духовность":
                    n = str(input("Какая мысль пугает вас более всего?"))
                    if n =="родители умрут":
                        print("вы какойто хлеб")
if z =="кто, если не я":
    x = str(input("Считаете ли вы, что каждый человек должен оставить после себя потомство?"))
    if x =="человек должен оставить после себя хоть что-то":
        c = str(input("Едите ли вы на ночь?"))
        if c =="это еще зачем?":
            v = str(input("Какое человеческое качество вам кажется наиболее мерзким?"))
            if v =="высокомерие":
                b = str(input("Какое качество вы считаете наиболее переоцененным?"))
                if b =="сострадательность":
                    n = str(input("Какая мысль пугает вас более всего?"))
                    if n =="партнер умрет":
                        print("вы бородинский  хлеб")
if z =="это еще зачем?":
    x = str(input("Считаете ли вы, что каждый человек должен оставить после себя потомство?"))
    if x =="это еще зачем?":
        c = str(input("Едите ли вы на ночь?"))
        if c =="да я лучше сгорю":
            v = str(input("Какое человеческое качество вам кажется наиболее мерзким?"))
            if v =="наглость":
                b = str(input("Какое качество вы считаете наиболее переоцененным?"))
                if b =="тактичность":
                    n = str(input("Какая мысль пугает вас более всего?"))
                    if n =="все умрут":
                        print("вы американскийхлеб") 






— всегда, я же альфа



— да я лучше сгорю



— кто, если не я







— это еще зачем?





















Считаете ли вы, что каждый человек должен оставить после себя потомство?





— конечно!



— только и делаю, что оставляю



— человек должен оставить после себя хоть что-то



— это еще зачем?
























Едите ли вы на ночь?





— еще как



— надо же хоть что-то делать







— это еще зачем?



— да я лучше сгорю































Какое человеческое качество вам кажется наиболее мерзким?





— тупость



— жадность



— высокомерие



— наглость





























Какое качество вы считаете наиболее переоцененным?





— оригинальность



— духовность







— сострадательность



— тактичность

































Какая мысль пугает вас более всего?





— я умру



— родители умрут



— партнер умрет



— все умрут



































